package lesson_08;

public class Main {
    public static void main(String[] args) {
        // 1. Создать класс игру, в которой у нас происходит игра
        // 2. Создаем игроков
        // 3. Создаем крупье
        // 4. Добавтить игроков и крупье в игру
        // 5. Добавить колоду карт
        // 6. Добавим карты в колоду
        // 7. Раздать каждому игроку по 2 карты на старте
        // 8. Раздавать каждому игроку по 1 карте, пока они это требуется
        // 9. Определить победителя

    }
}
